---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures
source: html/360aeda5-2ee5-f6b0-e4c2-f6a5fd6e8e62.htm
---
# BuiltInFailures.RebarShapeFailures Properties

A circle can't be converted to multiplanar shape.